app/controllers/secrets_controller.rb

SELECT COUNT(*) FROM "secrets"  WHERE (secrets.latitude BETWEEN 40.69611548394081 AND 40.714101916059185 AND secrets.longitude BETWEEN -74.02503630871325 AND -74.00130989128675)
SELECT secrets.*, (111.19492664455873 * ABS(secrets.latitude - 40.7051324) * 0.7071067811865475) + (96.29763124613503 * ABS(secrets.longitude - -74.0131857) * 0.7071067811865475) AS distance, CASE WHEN (secrets.latitude >= 40.7051324 AND secrets.longitude >= -74.0131857) THEN  45.0 WHEN (secrets.latitude <  40.7051324 AND secrets.longitude >= -74.0131857) THEN 135.0 WHEN (secrets.latitude <  40.7051324 AND secrets.longitude <  -74.0131857) THEN 225.0 WHEN (secrets.latitude >= 40.7051324 AND secrets.longitude <  -74.0131857) THEN 315.0 END AS bearing FROM "secrets"  WHERE (secrets.latitude BETWEEN 40.615200239408125 AND 40.79506456059187 AND secrets.longitude BETWEEN -74.13181782934811 AND -73.89455357065188)  ORDER BY distance ASC
---
  def index
    @secrets = Secret.all.sort_by{|s| s.vote_count}.reverse

SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @secret = Secret.find(params[:id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "secrets" ("address", "created_at", "message", "updated_at") VALUES (?, ?, ?, ?)  [["address", "Dublin, Ireland"], ["created_at", "2014-11-21 00:21:15.552911"], ["message", "I am drinking beer!"], ["updated_at", "2014-11-21 00:21:15.552911"]]
---
  def create
    @user = User.find(session[:user_id])
    @secret = @user.secrets.build(secret_params)
    if @secret.save

UPDATE "secrets" SET "message" = ?, "updated_at" = ? WHERE "secrets"."id" = 2  [["message", "I love BayMax! And Big Hero 6 the movie!"], ["updated_at", "2014-11-21 21:36:31.351395"]]
---
  def update
    respond_to do |format|
      if @secret.update(secret_params) && secret_authorized?

SELECT  "secrets".* FROM "secrets"  WHERE "secrets"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_secret
    @secret = Secret.find(params[:id])