app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["email", "flatironschool@google.com"], ["name", "Flatiron School"], ["updated_at", "2014-11-21 20:50:10.447096"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params) && user_authorized?